//
//  main.cpp
//  Contests_Reading_books
//
//  Created by Alex Noyanov on 19.03.19.
//  Copyright © 2019 Popoff Developer Studio. All rights reserved.
//

/*
 
 После уроков Настя решила почитать книжку. Книжка состоит из n
 n
 глав, идущих друг за другом, при этом каждая страница книги принадлежит ровно одной главе и каждая глава содержит хотя бы одну страницу.
 За вечер Настя не успела прочитать всю книгу и поэтому пометила страницу с номером k
 k
 как ту страницу, с которой она начнет читать на следующий вечер (т. е. она прочитала все страницы с 1
 1
 -й по (k−1)
 (
 k
 −
 1
 )
 -ю).
 
 На следующий день в школе друг Насти Игорь спросил у нее, сколько глав ей осталось прочитать
 
 */

#include <iostream>

using namespace std;

int main(int argc, const char * argv[]) {
    // insert code here...
    //std::cout << "Hello, World!\n";
    
    
    
    return 0;
}
